## データの取り出しかた

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

## シリーズについて

In [3]:
ser = Series(np.arange(3),index= ['A','B','C'])

In [4]:
ser

A    0
B    1
C    2
dtype: int64

In [5]:
ser = ser*2

In [6]:
ser

A    0
B    2
C    4
dtype: int64

In [7]:
ser[1]

2

In [8]:
ser['B']

2

In [9]:
ser[0:3]

A    0
B    2
C    4
dtype: int64

In [10]:
ser[['B','A']]

B    2
A    0
dtype: int64

In [11]:
ser[(ser>3)]

C    4
dtype: int64

In [12]:
ser[(ser>3)] = 111

In [13]:
ser

A      0
B      2
C    111
dtype: int64

## データフレームについて

In [22]:
dframe = DataFrame(np.arange(25).reshape((5,5)), index=['Tokyo','Kyoto','Osaka','Saitama','Gunma'],columns=['A','B','C','D','E'])

dframe

          A   B   C   D   E
Tokyo     0   1   2   3   4
Kyoto     5   6   7   8   9
Osaka    10  11  12  13  14
Saitama  15  16  17  18  19
Gunma    20  21  22  23  24

In [16]:
dframe['A']

Tokyo       0
Kyoto       5
Osaka      10
Saitama    15
Gunma      20
Name: A, dtype: int64

In [17]:
dframe[['C','A']]

          C   A
Tokyo     2   0
Kyoto     7   5
Osaka    12  10
Saitama  17  15
Gunma    22  20

In [20]:
dframe[dframe['C']>8]

          A   B   C   D   E
Osaka    10  11  12  13  14
Saitama  15  16  17  18  19
Gunma    20  21  22  23  24

In [21]:
dframe>10

             A      B      C      D      E
Tokyo    False  False  False  False  False
Kyoto    False  False  False  False  False
Osaka    False   True   True   True   True
Saitama   True   True   True   True   True
Gunma     True   True   True   True   True